In [11]:
import pandas as pd
path = 'Desktop/pandas_ex1.csv'
df = pd.read_csv(path)
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
pd.read_table(path)

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [13]:
pd.read_table(path, sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
path2 = 'Desktop/pandas_ex2.csv'
pd.read_csv(path2,header= None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [17]:
pd.read_csv(path2, names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
names = ['a','b','c','d','message']

In [19]:
pd.read_csv(path2, names= names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [20]:
path = 'Desktop/csv_mindex.csv'
parsed = pd.read_csv(path, index_col = ['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [24]:
pd.read_csv(path2, skiprows=[0,2])

Empty DataFrame
Columns: [5, 6, 7, 8, world]
Index: []

In [31]:
path3 = 'Desktop/ex5.csv'
result = pd.read_csv(path3)

In [32]:
result

  somthing  a   b     c   d message
0      one  1   2   3.0   4     NaN
1      two  5   6   NaN   8   world
2    three  9  10  11.0  12     foo

In [33]:
pd.isnull(result)

   somthing      a      b      c      d  message
0     False  False  False  False  False     True
1     False  False  False   True  False    False
2     False  False  False  False  False    False

In [34]:
result = pd.read_csv(path3, na_values=['NULL'])

In [35]:
result

  somthing  a   b     c   d message
0      one  1   2   3.0   4     NaN
1      two  5   6   NaN   8   world
2    three  9  10  11.0  12     foo

In [38]:
sentinels = {'message' : ['foo','NA'], 'somthing': ['two']}

pd.read_csv(path3, na_values = sentinels)

  somthing  a   b     c   d message
0      one  1   2   3.0   4     NaN
1      NaN  5   6   NaN   8   world
2    three  9  10  11.0  12     NaN

In [50]:
#Reading Text files in Pieces
pd.options.display.max_rows = 10

path5 ='Desktop/ipl_data.csv.txt'
results = pd.read_csv(path5, nrows = 5)

In [51]:
results

,match_code,date,city,venue,team1,team2,toss_winner,toss_decision,winner,win_type,...,batsman,non_striker,bowler,runs,extras,total,extras_type,player_out,wicket_kind,wicket_fielders
0,392203,2009-05-01,East London,Buffalo Park,Kolkata Knight Riders,Mumbai Indians,Mumbai Indians,bat,Mumbai Indians,runs,...,ST Jayasuriya,SR Tendulkar,I Sharma,0,1,1,wides,NaN,NaN,NaN
1,392203,2009-05-01,East London,Buffalo Park,Kolkata Knight Riders,Mumbai Indians,Mumbai Indians,bat,Mumbai Indians,runs,...,ST Jayasuriya,SR Tendulkar,I Sharma,1,0,1,NaN,NaN,NaN,NaN
2,392203,2009-05-01,East London,Buffalo Park,Kolkata Knight Riders,Mumbai Indians,Mumbai Indians,bat,Mumbai Indians,runs,...,SR Tendulkar,ST Jayasuriya,I Sharma,0,1,1,wides,NaN,NaN,NaN
3,392203,2009-05-01,East London,Buffalo Park,Kolkata Knight Riders,Mumbai Indians,Mumbai Indians,bat,Mumbai Indians,runs,...,SR Tendulkar,ST Jayasuriya,I Sharma,0,0,0,NaN,NaN,NaN,NaN
4,392203,2009-05-01,East London,Buffalo Park,Kolkata Knight Riders,Mumbai Indians,Mumbai Indians,bat,Mumbai Indians,runs,...,SR Tendulkar,ST Jayasuriya,I Sharma,2,0,2,NaN,NaN,NaN,NaN

In [52]:
chunker = pd.read_csv(path5, chunksize = 1000)

In [53]:
chunker

In [57]:
chunker = pd.read_csv(path5,chunksize = 1000)

tot = pd.Series([])
for piece in chunker:
    tot= tot.add(piece['total'].value_counts(),fill_value = 0)
    
tot = tot.sort_values(ascending = False)

/home/rohit/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

In [60]:
data = pd.read_csv(path3)

In [61]:
data

  somthing  a   b     c   d message
0      one  1   2   3.0   4     NaN
1      two  5   6   NaN   8   world
2    three  9  10  11.0  12     foo

In [62]:
data.to_csv('Desktop/madefile.csv')

In [63]:
import sys

data.to_csv(sys.stdout, sep ='|')

|somthing|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [64]:
data.to_csv(sys.stdout, na_rep ='NULL')

,somthing,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [65]:
data.to_csv(sys.stdout, index = False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [66]:
data.to_csv(sys.stdout, index = False, columns = ['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [67]:
dates = pd.date_range(1/1/2000, periods = 7)

In [69]:
import numpy as np
ts = pd.Series(np.arange(7),index=dates)

In [70]:
ts.to_csv('Desktop/made2.csv')

In [71]:
import csv
f = open(path3)
reader = csv.reader(f)

In [72]:
for line in reader:
    print(line)

['somthing', 'a', 'b', 'c', 'd', 'message']
['one', '1', '2', '3', '4', 'NA']
['two', '5', '6', '', '8', 'world']
['three', '9', '10', '11', '12', 'foo']

In [73]:
with open(path3) as f:
    lines = list(csv.reader(f))

In [74]:
header, values = lines[0], lines[1:]

In [75]:
#zip(*values) transposes rows to columns
data_dict = {h: v for h, v in zip(header, zip(*values))}

data_dict

{'somthing': ('one', 'two', 'three'),
 'a': ('1', '5', '9'),
 'b': ('2', '6', '10'),
 'c': ('3', '', '11'),
 'd': ('4', '8', '12'),
 'message': ('NA', 'world', 'foo')}

In [82]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
    
reader = csv.reader(f, dialect=my_dialect)

TypeError: argument 1 must be an iterator

In [78]:
reader = csv.reader(f, delimiter = '|')

TypeError: argument 1 must be an iterator

In [81]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f,dialect= my_dialect)
    writer.writerow(('one','two','three'))
    writer.writerow(('1','2','3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7','8','9'))

In [88]:
obj = """
{"name" : "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": "null",
"siblings":[{"name": "Scott", "age":30, "pets":["Zeus", "Zuko"]},
            {"name":"Katie", "age":38,
            "pets":["sixes", "Stache","Cisco"]}]
            }
            """


#JSON Data
import json
result = json.loads(obj)

result

In [89]:
import json
result = json.loads(obj)

In [90]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': 'null',
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['sixes', 'Stache', 'Cisco']}]}

In [91]:
asjson = json.dumps(result)

In [92]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": "null", "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["sixes", "Stache", "Cisco"]}]}'

In [94]:
siblings = pd.DataFrame(result['siblings'], columns = ['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [95]:
#xml and HTML: Web Scraping
tables = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [96]:
len(tables)

1

In [97]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [98]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2007      3
2003      3
2020      2
2000      2
Name: Closing Date, Length: 18, dtype: int64